[
{
"recipename":"Aaloo Samosa",
"ingredients":"• Maida - 2 cups (250 grams)\n• Ghee - 1/4 cup (60 grams)\n• Salt - 1/2 teaspoon (as per taste)\n• Potatoes - 400 grams (4 medium sized potatoes)\n• Green peas - 1/2 cup (if you want)\n• Cashew - 10 -12 (if you want)\n• Raisins - 25 -30 (if you want)\n• Green chillies - 2-3 finely chopped\n• Ginger - 1 inch long piece (grated)\n• Coriander leaves - 2 tbsp (finely chopped)\n• Coriander powder - 1 tsp\n• Garam masala - 1/4 teaspoon\n• Mango powder - 1/2 teaspoon\n• Salt - 3/4 tsp or as per taste\n• Oil- For Frying",
"procedure":"• First of all, keep the potatoes for boiling.\n• Add butter and salt in maida and mix well. Knead a little hard dough with the help of lukewarm water. Cover the dough and keep it aside for 15 - 20 minutes to set.\n• Now prepare the filling for the samosas.\n• Peel the boiled potatoes, and finely chop them by hand. Heat a pan, add 1 teaspoon of oil, mix ginger, green chilli and green peas in hot oil, mix, cover and let it cook for 2 minutes, the green peas will become slightly soft. Add finely broken potatoes, add salt, green chillies, green coriander, coriander powder, garam masala, mango powder, raisins and cashews and mix until well combined. The samosa filling is ready.\n• Make 7-8 equal size balls from the dough. Take a ball and roll it into a diameter of about 8 - 10 inches. Make sure it remains slightly thick.\n• Cut the rolled puri into two equal parts with the help of a knife. Fold one part into a tikon(Cone shape).While making the tikon, stick both ends with water.\n• Put the filling in the Tikon. After filling is done, Make the back edge flat like a plate and stick both the top edges with the help of water. See that the size of the samosas is right. Likewise prepare all the samosas.\n• To fry the samosas, put oil in a pan and heat it. Put 4-5 samosas in the hot oil and fry till it turns brown, while frying the samosas, the gas flame remains medium. Take out the samosas from the pan and place them on a napkin paper, lying on a plate. Fry all the samosas in this way.\n• Hot Samosa is ready. Serve and eat samosas with green coriander chutney and sweet chutney."
}
]
