[
{
"recipename":"Potato Samosa",
"ingredients":"Maida - 2 cups (250 grams)\nGhee - 1/4 cup (60 grams)\nSalt - 1/2 teaspoon (as per taste)\nPotatoes - 400 grams (4 medium sized potatoes)\nGreen peas - 1/2 cup (if you want)\nCashew - 10 -12 (if you want)\nRaisins - 25 -30 (if you want)\nGreen chillies - 2-3 finely chopped\nGinger - 1 inch long piece (grated)\nCoriander leaves - 2 tbsp (finely chopped)\nCoriander powder - 1 tsp\nGaram masala - 1/4 teaspoon\nMango powder - 1/2 teaspoon\nSalt - 3/4 tsp or as per taste\nOil for Frying",
"procedure":"First of all, keep the potatoes boiling.\nAdd clarified butter and salt, mix well.  Knead a little hard dough with the help of lukewarm water.  Cover the dough and keep it aside for 15 - 20 minutes to set.\nPrepare Pitha for filling in samosas.\nPeel the boiled potatoes, and finely chop them by hand.  Heat a pan, add 1 teaspoon of oil, mix ginger, green chilli and green peas in hot oil, mix, cover and let it cook for 2 minutes, the green peas will become slightly soft.  Add finely broken potatoes, add salt, green chillies, green coriander, coriander powder, garam masala, mango powder, raisins and cashews and mix until well combined.  Pithi is ready for filling in samosas.\nMake 7-8 equal size balls from the dough.  Take a ball and roll it into a diameter of about 8 - 10 inches.  The whole of the rolled should remain slightly thick.\nCut the rolled puri into two equal parts with the help of a knife.  Fold one part into a tikon (while making the tikon, stick both ends with water).\nPut potato pit in the Tikon.  After filling the Pitha, put a plate in the back edge, and let both the top edges cool with the help of water.  See the size of the samosas is right.  Likewise prepare all the samosas.\nTo fry the samosas, put oil in a pan and heat it.  Put 4-5 samosas in the hot oil and fry till it turns brown, while frying the samosas, the gas flame remains medium.  Take out the samosas from the pan and place them on a napkin paper, lying on a plate.  Fry all the samosas in this way.\n\nHot Samosa is ready.  Serve and eat samosas with green coriander chutney and sweet chutney."
}
]
